{"Game of Thrones": {
  "data": {"tvshow": {"title": "Game of Thrones", "season": "all", "criticScore": 86, "releaseDate": "April 17, 2011", "genres": ["Fantasy"], "summary": "Adapted from George R.R. Martin's epic fantasy novel series \"A Song of Ice and Fire\", this series is about a fantasy world where royal houses battle for the Iron Throne.", "numOfCriticReviews": 171, "numOfPositiveCriticReviews": 159, "numOfMixedCriticReviews": 11, "numOfNegativeCriticReviews": 1, "productImage": "https://static.metacritic.com/images/products/tv/5/25b577800d6e543af264cab55c5e07d6-98.jpg"}}},

  "The Walking Dead": {
    "data": {"tvshow": {"title": "The Walking Dead", "season": "all", "criticScore": 79, "releaseDate": "October 31, 2010", "genres": ["Science Fiction"], "summary": "Based on a comic book series of the same name by Robert Kirkman, a small group of survivors, led by officer Rick Grimes (Andrew Lincoln), must fight a world full of zombies.", "numOfCriticReviews": 115, "numOfPositiveCriticReviews": 100, "numOfMixedCriticReviews": 14, "numOfNegativeCriticReviews": 1, "productImage": "https://static.metacritic.com/images/products/tv/8/a18605889a33113d398356e0fc1d5d3f-98.jpg"}}},

  "The Handmaid's Tale": {
    "data": {"tvshow": {"title": "The Handmaid's Tale", "season": "all", "criticScore": 84, "releaseDate": "April 26, 2017", "genres": ["Science Fiction"], "summary": "Based on Margaret Atwood’s best-selling novel, in the totalitarian society of Gilead, a handmaiden enslaved to produce a child for Commander Waterford (Joseph Fiennes) and his wife Serena Joy (Yvonne Strahovski) named Offred (Elisabeth Moss) seeks the daughter taken from her.", "numOfCriticReviews": 90, "numOfPositiveCriticReviews": 80, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/1/250601dd7f2decfc33c022bf413501bc-98.jpg"}}},

  "Dexter": {
    "data": {"tvshow": {"title": "Dexter", "season": "all", "criticScore": 76, "releaseDate": "October 1, 2006", "genres": ["Suspense"], "summary": "Based on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". BasedBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". Based on a code instilled in him by his foster father, Harry, he hunts down people who have escaped justice and makes sure they don't get away with a crime again.… ExpandBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". BasedBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". Based on a code instilled in him by his foster father, Harry, he hunts down people who have escaped justice and makes sure they don't get away with a crime again.…Expand", "numOfCriticReviews": 103, "numOfPositiveCriticReviews": 88, "numOfMixedCriticReviews": 14, "numOfNegativeCriticReviews": 1, "productImage": "https://static.metacritic.com/images/products/tv/3/bd39899fe9b6cc621d6d64ad8f9aca61-98.jpg"}}},

  "The Simpsons": {
    "data": {"tvshow": {"title": "The Simpsons", "season": "all", "criticScore": 87, "releaseDate": "December 17, 1989", "genres": ["Animation"], "summary": "Originally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for threeOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success.\n\nSet in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.\n\nCurrently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\"… ExpandOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for threeOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success.\n\nSet in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.\n\nCurrently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\"…Expand", "numOfCriticReviews": 16, "numOfPositiveCriticReviews": 15, "numOfMixedCriticReviews": 1, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/2/ab3af004d601914468810fa1bd16cff9-98.jpg"}}},

  "Friends: The Reunion": {
    "data": {"tvshow": {"title": "Friends: The Reunion", "season": "all", "criticScore": 69, "releaseDate": "May 27, 2021", "genres": ["Events & Specials"], "summary": "The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin,The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin, Mindy Kaling, Thomas Lennon, Christina Pickles, Tom Selleck, James Michael Tyler, Maggie Wheeler, Reese Witherspoon and Malala Yousafzai.… ExpandThe cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin,The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin, Mindy Kaling, Thomas Lennon, Christina Pickles, Tom Selleck, James Michael Tyler, Maggie Wheeler, Reese Witherspoon and Malala Yousafzai.…Expand", "numOfCriticReviews": 11, "numOfPositiveCriticReviews": 8, "numOfMixedCriticReviews": 3, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/6/4c162d122aeef2d95f4a49af7a1f6def-98.jpg"}}},

  "The Boys": {
    "data": {"tvshow": {"title": "The Boys", "season": "all", "criticScore": 77, "releaseDate": "July 26, 2019", "genres": ["Action & Adventure"], "summary": "Eric Kripke and Evan Goldberg's superhero series, based on the comic book of the same name by Garth Ennis and Darick Robertson focuses on a group of vigilantes that include Billy Butcher (Karl Urban), Hughie (Jack Quaid), Mother’s Milk (Laz Alonso), Female (Karen Fukuhara), and Frenchie (Tomer Capon).", "numOfCriticReviews": 47, "numOfPositiveCriticReviews": 41, "numOfMixedCriticReviews": 6, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/3/0ea4b3ae778091a855196e3f03d53fb6-98.jpg"}}},

  "House of Cards": {
    "data": {"tvshow": {"title": "House of Cards", "season": "all", "criticScore": 85, "releaseDate": "November 18, 1990", "genres": ["Suspense"], "summary": "This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991,This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991, and was remade over two decades later as the Netflix original series of the same name (starring Kevin Spacey).… ExpandThis four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991,This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991, and was remade over two decades later as the Netflix original series of the same name (starring Kevin Spacey).…Expand", "numOfCriticReviews": 11, "numOfPositiveCriticReviews": 11, "numOfMixedCriticReviews": 0, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/6/f471b3d839839b4a60ea4f8a4fcf30f5-98.jpg"}}},

  "Fargo": {
    "data": {"tvshow": {"title": "Fargo", "season": "all", "criticScore": 90, "releaseDate": "April 15, 2014", "genres": ["Suspense"], "summary": "The series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and DuluthThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and Duluth Deputy Gus Grimly (Colin Hanks). Other people in town include grocery chain owner Stavros Milos (Oliver Platt), widow Gina Hess (Kate Walsh), and Deputy Bill Oswalt (Bob Odenkirk).… ExpandThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and DuluthThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and Duluth Deputy Gus Grimly (Colin Hanks). Other people in town include grocery chain owner Stavros Milos (Oliver Platt), widow Gina Hess (Kate Walsh), and Deputy Bill Oswalt (Bob Odenkirk).…Expand", "numOfCriticReviews": 105, "numOfPositiveCriticReviews": 102, "numOfMixedCriticReviews": 3, "numOfNegativeCriticReviews": 0, "productImage": "https://static.metacritic.com/images/products/tv/2/dc64b26986b0440a8b9debc99b2908f1-98.jpg"}}}}