{"Game of Thrones": {"data": {"tvshow": {"title": "Game of Thrones", "season": "all", "criticScore": 86, "releaseDate": "April 17, 2011", "genres": ["Fantasy"], "summary": "Adapted from George R.R. Martin's epic fantasy novel series \"A Song of Ice and Fire\", this series is about a fantasy world where royal houses battle for the Iron Throne.", "numOfCriticReviews": 171, "numOfPositiveCriticReviews": 159, "numOfMixedCriticReviews": 11, "numOfNegativeCriticReviews": 1}}}, "The Walking Dead": {"data": {"tvshow": {"title": "The Walking Dead", "season": "all", "criticScore": 79, "releaseDate": "October 31, 2010", "genres": ["Science Fiction"], "summary": "Based on a comic book series of the same name by Robert Kirkman, a small group of survivors, led by officer Rick Grimes (Andrew Lincoln), must fight a world full of zombies.", "numOfCriticReviews": 115, "numOfPositiveCriticReviews": 100, "numOfMixedCriticReviews": 14, "numOfNegativeCriticReviews": 1}}}, "The Handmaid's Tale": {"data": {"tvshow": {"title": "The Handmaid's Tale", "season": "all", "criticScore": 84, "releaseDate": "April 26, 2017", "genres": ["Science Fiction"], "summary": "Based on Margaret Atwood’s best-selling novel, in the totalitarian society of Gilead, a handmaiden enslaved to produce a child for Commander Waterford (Joseph Fiennes) and his wife Serena Joy (Yvonne Strahovski) named Offred (Elisabeth Moss) seeks the daughter taken from her.", "numOfCriticReviews": 90, "numOfPositiveCriticReviews": 80, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 0}}}, "Dexter": {"data": {"tvshow": {"title": "Dexter", "season": "all", "criticScore": 76, "releaseDate": "October 1, 2006", "genres": ["Suspense"], "summary": "Based on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". BasedBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". Based on a code instilled in him by his foster father, Harry, he hunts down people who have escaped justice and makes sure they don't get away with a crime again.… ExpandBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". BasedBased on Jeff Lindsay's novels Darkly Dreaming Dexter and Dearly Devoted Dexter this crime thriller follows Dexter Morgan. Dexter is a forensic blood spatter expert for the Miami Dade Police Department. He is the main support for his sister. He has a steady girlfriend, with two kids who adore him. He also has an active \"night life\". Based on a code instilled in him by his foster father, Harry, he hunts down people who have escaped justice and makes sure they don't get away with a crime again.…Expand", "numOfCriticReviews": 103, "numOfPositiveCriticReviews": 88, "numOfMixedCriticReviews": 14, "numOfNegativeCriticReviews": 1}}}, "The Simpsons": {"data": {"tvshow": {"title": "The Simpsons", "season": "all", "criticScore": 87, "releaseDate": "December 17, 1989", "genres": ["Animation"], "summary": "Originally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for threeOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success.\n\nSet in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.\n\nCurrently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\"… ExpandOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for threeOriginally created by cartoonist Matt Groening, \"Our Favorite Family,\" has graced the small screen in one form or another for over 20 years. The Simpson family first appeared on television as the subjects of interstitial \"shorts\" on The Tracey Ullman Show in April of 1987. The Simpsons remained a staple on The Tracey Ullman Show for three seasons until they premiered in their own half-hour series, on December 17, 1989. With the help of Jim Brooks and Sam Simon, Matt Groening's cartoon family turned into an instant success.\n\nSet in Springfield, the average American town, the show focuses on the antics and everyday adventures of the Simpson family; Homer, Marge, Bart, Lisa and Maggie, as well as a virtual cast of thousands. Since the beginning, the series has been a pop culture icon, attracting hundreds of celebrities to guest star. The show has also made name for itself in its fearless satirical take on politics, media and American life in general.\n\nCurrently in its 21st season, The Simpsons has piled up over 440 episodes, over 20 Emmy Awards, a handful of music albums, countless endorsements and merchandise, and even made the jump to the silver screen in the summer of 2007 with The Simpsons Movie. And according to Matt Groening, \"There is no end in sight.\"…Expand", "numOfCriticReviews": 16, "numOfPositiveCriticReviews": 15, "numOfMixedCriticReviews": 1, "numOfNegativeCriticReviews": 0}}}, "Friends: The Reunion": {"data": {"tvshow": {"title": "Friends: The Reunion", "season": "all", "criticScore": 69, "releaseDate": "May 27, 2021", "genres": ["Events & Specials"], "summary": "The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin,The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin, Mindy Kaling, Thomas Lennon, Christina Pickles, Tom Selleck, James Michael Tyler, Maggie Wheeler, Reese Witherspoon and Malala Yousafzai.… ExpandThe cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin,The cast of \"Friends\" return to the original soundstage where they filmed the series to reminisce and test their knowledge of the show against each other in the special that also includes appearances from David Beckham, Justin Bieber, BTS, James Corden, Cindy Crawford, Cara Delevingne, Lady Gaga, Elliott Gould, Kit Harington, Larry Hankin, Mindy Kaling, Thomas Lennon, Christina Pickles, Tom Selleck, James Michael Tyler, Maggie Wheeler, Reese Witherspoon and Malala Yousafzai.…Expand", "numOfCriticReviews": 11, "numOfPositiveCriticReviews": 8, "numOfMixedCriticReviews": 3, "numOfNegativeCriticReviews": 0}}}, "The Boys": {"data": {"tvshow": {"title": "The Boys", "season": "all", "criticScore": 77, "releaseDate": "July 26, 2019", "genres": ["Action & Adventure"], "summary": "Eric Kripke and Evan Goldberg's superhero series, based on the comic book of the same name by Garth Ennis and Darick Robertson focuses on a group of vigilantes that include Billy Butcher (Karl Urban), Hughie (Jack Quaid), Mother’s Milk (Laz Alonso), Female (Karen Fukuhara), and Frenchie (Tomer Capon).", "numOfCriticReviews": 47, "numOfPositiveCriticReviews": 41, "numOfMixedCriticReviews": 6, "numOfNegativeCriticReviews": 0}}}, "House of Cards": {"data": {"tvshow": {"title": "House of Cards", "season": "all", "criticScore": 85, "releaseDate": "November 18, 1990", "genres": ["Suspense"], "summary": "This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991,This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991, and was remade over two decades later as the Netflix original series of the same name (starring Kevin Spacey).… ExpandThis four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991,This four-episode British miniseries is a political thriller based on the novel by Michael Dobbs, which follows a scheming MP (played by Ian Richardson) in his quest to become Prime Minister. The adaptation comes from Andrew Davies (Bridget Jones's Diary). House of Cards aired in the U.S. on PBS as part of Masterpiece Theatre in early 1991, and was remade over two decades later as the Netflix original series of the same name (starring Kevin Spacey).…Expand", "numOfCriticReviews": 11, "numOfPositiveCriticReviews": 11, "numOfMixedCriticReviews": 0, "numOfNegativeCriticReviews": 0}}}, "Fargo": {"data": {"tvshow": {"title": "Fargo", "season": "all", "criticScore": 90, "releaseDate": "April 15, 2014", "genres": ["Suspense"], "summary": "The series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and DuluthThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and Duluth Deputy Gus Grimly (Colin Hanks). Other people in town include grocery chain owner Stavros Milos (Oliver Platt), widow Gina Hess (Kate Walsh), and Deputy Bill Oswalt (Bob Odenkirk).… ExpandThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and DuluthThe series based on the Coen brothers’ Oscar-winning film begins with the arrival of Lorne Malvo (Billy Bob Thornton) to Minnesota. Lorne's actions brings major changes to the lives of insurance salesman Lester Nygaard (Martin Freeman); Officer Molly Solverson (Alison Tolman), the daughter of former chief (Keith Carradine); and Duluth Deputy Gus Grimly (Colin Hanks). Other people in town include grocery chain owner Stavros Milos (Oliver Platt), widow Gina Hess (Kate Walsh), and Deputy Bill Oswalt (Bob Odenkirk).…Expand", "numOfCriticReviews": 105, "numOfPositiveCriticReviews": 102, "numOfMixedCriticReviews": 3, "numOfNegativeCriticReviews": 0}}}, "The Haunting of Hill House": {"data": {"tvshow": {"title": "The Haunting of Hill House", "season": "all", "criticScore": 79, "releaseDate": "October 12, 2018", "genres": ["Horror"], "summary": "Mike Flanagan's re-imagining of Shirley Jackson's novel focuses on the grown-up siblings who lived in Hill House including writer Steve Crane (Michiel Huisman) and his two sisters (Elizabeth Reaser and Kate Siegel) as they return to face their past.", "numOfCriticReviews": 18, "numOfPositiveCriticReviews": 15, "numOfMixedCriticReviews": 3, "numOfNegativeCriticReviews": 0}}}, "The Mandalorian": {"data": {"tvshow": {"title": "The Mandalorian", "season": "all", "criticScore": 71, "releaseDate": "November 15, 2019", "genres": ["Science Fiction"], "summary": "The Mandalorian (Pedro Pascal) travels the galaxy, out of reach of the New Republic after the fall of the Empire in Disney+'s first Star Wars live-action series.", "numOfCriticReviews": 43, "numOfPositiveCriticReviews": 33, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 0}}}, "True Blood": {"data": {"tvshow": {"title": "True Blood", "season": "all", "criticScore": 69, "releaseDate": "September 7, 2008", "genres": ["Suspense"], "summary": "Sookie Stackhouse comes to television in the Alan Ball adaptation of Charlaine Harris' Southern vampire series.", "numOfCriticReviews": 110, "numOfPositiveCriticReviews": 69, "numOfMixedCriticReviews": 38, "numOfNegativeCriticReviews": 3}}}, "Westworld": {"data": {"tvshow": {"title": "Westworld", "season": "all", "criticScore": 72, "releaseDate": "October 2, 2016", "genres": ["Science Fiction"], "summary": "The sci-fi western series from Jonathan Nolan and Lisa Joy was inspired by the 1973 Michael Crichton film of the same name and is set at a Wild West theme park created by Dr. Robert Ford (Anthony Hopkins) with human-like androids where guests are encouraged to indulge their desires.", "numOfCriticReviews": 105, "numOfPositiveCriticReviews": 76, "numOfMixedCriticReviews": 28, "numOfNegativeCriticReviews": 1}}}, "The Vampire Diaries": {"data": {"tvshow": {"title": "The Vampire Diaries", "season": "all", "criticScore": 57, "releaseDate": "September 10, 2009", "genres": ["Horror"], "summary": "In this adaptation of the L.J. Smith book series, vampire brothers battle for the heart of a mortal teenaged girl named Elena Gilbert.", "numOfCriticReviews": 31, "numOfPositiveCriticReviews": 16, "numOfMixedCriticReviews": 8, "numOfNegativeCriticReviews": 7}}}, "The Umbrella Academy": {"data": {"tvshow": {"title": "The Umbrella Academy", "season": "all", "criticScore": 63, "releaseDate": "February 15, 2019", "genres": ["Science Fiction"], "summary": "Luther (Tom Hopper), Diego (David Castañeda), Allison (Emmy Raver-Lampman), Klaus (Robert Sheehan), Vanya (Elliot Page) and Number Five (Aidan Gallagher) are brought back together by the death of their adoptive father (Colm Feore) in this series based on the comics and graphic novels by My Chemical Romance's Gerard Way.", "numOfCriticReviews": 38, "numOfPositiveCriticReviews": 20, "numOfMixedCriticReviews": 16, "numOfNegativeCriticReviews": 2}}}, "The Handmaid's Tale Season 2": {"errors": [{"message": "Error: Product has no reviews or does not exist for: {\n  \"title\": \"The Handmaid's Tale Season 2\",\n  \"type\": \"tvshow\"\n}, tvshow", "locations": [{"line": 2, "column": 1}], "path": ["tvshow"], "extensions": {"code": "INTERNAL_SERVER_ERROR"}}], "data": {"tvshow": null}}, "The Blacklist": {"data": {"tvshow": {"title": "The Blacklist", "season": "all", "criticScore": 74, "releaseDate": "September 23, 2013", "genres": ["Suspense"], "summary": "One of the FBI's most wanted men Raymond \"Red\" Reddington (James Spader) offers to turns himself in to help catch a presumed-dead terrorist, but only if he is partnered with newly graduated profiler, Liz Keen (Megan Boone).", "numOfCriticReviews": 32, "numOfPositiveCriticReviews": 27, "numOfMixedCriticReviews": 5, "numOfNegativeCriticReviews": 0}}}, "The 100": {"data": {"tvshow": {"title": "The 100", "season": "all", "criticScore": 64, "releaseDate": "March 19, 2014", "genres": ["Science Fiction"], "summary": "Based on the Alloy books by Kass Morgan, 97 years after a nuclear war destroyed Earth and forced survivors to flee to space stations, a secret project by leaders of the group sends 100 juvenile prisoners back to Earth to see if it is viable once again.", "numOfCriticReviews": 34, "numOfPositiveCriticReviews": 23, "numOfMixedCriticReviews": 9, "numOfNegativeCriticReviews": 2}}}, "The Flash": {"data": {"tvshow": {"title": "The Flash", "season": "all", "criticScore": 67, "releaseDate": "September 20, 1990", "genres": ["Fantasy"], "summary": "The Flash is the story of Barry Allen, a police scientist who is the victim of a freak accident. While working late, his lab is hit by lightning. The blast shatters a number of vials, so Barry is both electrocuted and bathed in dozens of chemicals. When he recovers, Barry finds that he has gained the ability to move at almost impossibleThe Flash is the story of Barry Allen, a police scientist who is the victim of a freak accident. While working late, his lab is hit by lightning. The blast shatters a number of vials, so Barry is both electrocuted and bathed in dozens of chemicals. When he recovers, Barry finds that he has gained the ability to move at almost impossible speed. Fellow scientist Christina \"Tina\" McGee works with Barry to help him control his new found powers, even constructing a frictionless suit for him which will not be destroyed by his speed. Donning the red and yellow suit, Barry hides his identity from the world as he uses his powers to fight those who the police cannot catch. In doing so he begins to create the legend of the anonymous scarlet speedster known as The Flash.… ExpandThe Flash is the story of Barry Allen, a police scientist who is the victim of a freak accident. While working late, his lab is hit by lightning. The blast shatters a number of vials, so Barry is both electrocuted and bathed in dozens of chemicals. When he recovers, Barry finds that he has gained the ability to move at almost impossibleThe Flash is the story of Barry Allen, a police scientist who is the victim of a freak accident. While working late, his lab is hit by lightning. The blast shatters a number of vials, so Barry is both electrocuted and bathed in dozens of chemicals. When he recovers, Barry finds that he has gained the ability to move at almost impossible speed. Fellow scientist Christina \"Tina\" McGee works with Barry to help him control his new found powers, even constructing a frictionless suit for him which will not be destroyed by his speed. Donning the red and yellow suit, Barry hides his identity from the world as he uses his powers to fight those who the police cannot catch. In doing so he begins to create the legend of the anonymous scarlet speedster known as The Flash.…Expand", "numOfCriticReviews": 9, "numOfPositiveCriticReviews": 6, "numOfMixedCriticReviews": 2, "numOfNegativeCriticReviews": 1}}}, "Sherlock": {"data": {"tvshow": {"title": "Sherlock", "season": "all", "criticScore": 88, "releaseDate": "July 25, 2010", "genres": ["Suspense"], "summary": "This three-part series retells the tale of England's most celebrated detective but in a modern-day setting, with Benedict Cumberbatch and Martin Freeman taking the leads as Sherlock Holmes and Dr John Watson respectively.", "numOfCriticReviews": 67, "numOfPositiveCriticReviews": 65, "numOfMixedCriticReviews": 2, "numOfNegativeCriticReviews": 0}}}, "The Walking Dead Season 2": {"errors": [{"message": "Error: Product has no reviews or does not exist for: {\n  \"title\": \"The Walking Dead Season 2\",\n  \"type\": \"tvshow\"\n}, tvshow", "locations": [{"line": 2, "column": 1}], "path": ["tvshow"], "extensions": {"code": "INTERNAL_SERVER_ERROR"}}], "data": {"tvshow": null}}, "Big Little Lies": {"data": {"tvshow": {"title": "Big Little Lies", "season": "all", "criticScore": 78, "releaseDate": "February 19, 2017", "genres": ["Drama"], "summary": "The David E. Kelley adaptation of Liane Moriarity's novel of the same name about how seemingly perfect lives of three mothers of kindergartners--Celeste (Nicole Kidman), Madeline (Reese Witherspoon) and Jane (Shailene Woodley)--end in murder.", "numOfCriticReviews": 78, "numOfPositiveCriticReviews": 68, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 0}}}, "Gossip Girl": {"data": {"tvshow": {"title": "Gossip Girl", "season": "all", "criticScore": 59, "releaseDate": "September 19, 2007", "genres": ["Drama"], "summary": "Based on the popular book series of the same name, this drama gives viewers a peek into the world of privileged teenagers on an elite private school in New York City. The story is written by The O.C.'s Josh Schwartz and Stephanie Savage, and directed by Mark Piznarski who has worked on series like Everwood and Veronica Mars.Surface'sBased on the popular book series of the same name, this drama gives viewers a peek into the world of privileged teenagers on an elite private school in New York City. The story is written by The O.C.'s Josh Schwartz and Stephanie Savage, and directed by Mark Piznarski who has worked on series like Everwood and Veronica Mars.Surface's Leighton Meester and Accepted's Blake Lively have taken the lead roles in this drama series. They will play Blair and Serena respectively, rich Manhattan rivals at a private school in New York. The last additions to this new CW drama are Misconceptions' Taylor Momsen, The Covenant's Chace Crawford and The Bedford Diaries' Penn Badgley. Their characters are Momsen as Jenny a 14 year-old and shy girl, Nate the good looking boyfriend of Blair, and Dan the secret admirer of Serena. E-Ring's Kelly Rutherford and The Jury's has been cast as the mother of lead role Serena. Rutherford will play the mother of Serena van der Woodsen (Lively's character), a former ballerina and rock groupie. Afterlife's Ed Westwick has been cast as Chuck Bass and Brothers and Sisters' Matthew Settle has been cast as Jenny and Dan's father, Rufus Humphrey.… ExpandBased on the popular book series of the same name, this drama gives viewers a peek into the world of privileged teenagers on an elite private school in New York City. The story is written by The O.C.'s Josh Schwartz and Stephanie Savage, and directed by Mark Piznarski who has worked on series like Everwood and Veronica Mars.Surface'sBased on the popular book series of the same name, this drama gives viewers a peek into the world of privileged teenagers on an elite private school in New York City. The story is written by The O.C.'s Josh Schwartz and Stephanie Savage, and directed by Mark Piznarski who has worked on series like Everwood and Veronica Mars.Surface's Leighton Meester and Accepted's Blake Lively have taken the lead roles in this drama series. They will play Blair and Serena respectively, rich Manhattan rivals at a private school in New York. The last additions to this new CW drama are Misconceptions' Taylor Momsen, The Covenant's Chace Crawford and The Bedford Diaries' Penn Badgley. Their characters are Momsen as Jenny a 14 year-old and shy girl, Nate the good looking boyfriend of Blair, and Dan the secret admirer of Serena. E-Ring's Kelly Rutherford and The Jury's has been cast as the mother of lead role Serena. Rutherford will play the mother of Serena van der Woodsen (Lively's character), a former ballerina and rock groupie. Afterlife's Ed Westwick has been cast as Chuck Bass and Brothers and Sisters' Matthew Settle has been cast as Jenny and Dan's father, Rufus Humphrey.…Expand", "numOfCriticReviews": 40, "numOfPositiveCriticReviews": 21, "numOfMixedCriticReviews": 9, "numOfNegativeCriticReviews": 10}}}, "The Man in the High Castle": {"data": {"tvshow": {"title": "The Man in the High Castle", "season": "all", "criticScore": 73, "releaseDate": "November 20, 2015", "genres": ["Drama"], "summary": "Based on a novel by Phillip Dick where the Axis powers won World War II after dropping an atomic bomb on Washington D.C. Julianna (Alexa Davalos) leaves San Francisco for Japan to search for her sister's killer and new resistance recruit Joe (Luke Kleintank) is in New York to be assigned his first mission.", "numOfCriticReviews": 46, "numOfPositiveCriticReviews": 40, "numOfMixedCriticReviews": 4, "numOfNegativeCriticReviews": 2}}}, "Riverdale": {"data": {"tvshow": {"title": "Riverdale", "season": "all", "criticScore": 68, "releaseDate": "January 26, 2017", "genres": ["Drama"], "summary": "Greg Berlanti adds another comic series to his list by bringing Archie (KJ Apa), Betty (Lili Reinhart), Veronica (Camila Mendes) and Jughead (Cole Sprouse) to the CW in this present-day set series.", "numOfCriticReviews": 41, "numOfPositiveCriticReviews": 29, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 2}}}, "The Killing": {"data": {"tvshow": {"title": "The Killing", "season": "all", "criticScore": 72, "releaseDate": "April 3, 2011", "genres": ["Suspense"], "summary": "Based on a popular Danish series called Forbrydelsen, this AMC crime drama project follows three different subplots all linked to a single murder.", "numOfCriticReviews": 87, "numOfPositiveCriticReviews": 64, "numOfMixedCriticReviews": 23, "numOfNegativeCriticReviews": 0}}}, "The Expanse": {"data": {"tvshow": {"title": "The Expanse", "season": "all", "criticScore": 72, "releaseDate": "December 14, 2015", "genres": ["Science Fiction"], "summary": "Based on the book series by Daniel Abraham and Ty Franck (under the pen name James S. A. Corey), Detective Miller (Thomas Jane) is given the assignment to find a missing heiress and meets Holden (Steven Strait), who works on a freighter called the Canterbury.", "numOfCriticReviews": 40, "numOfPositiveCriticReviews": 30, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 0}}}, "Fringe": {"data": {"tvshow": {"title": "Fringe", "season": "all", "criticScore": 72, "releaseDate": "September 9, 2008", "genres": ["Science Fiction"], "summary": "FBI agent Olivia Dunham (Anna Torv), Peter Bishop (Joshua Jackson) and his estranged father Walter Bishop (John Noble) are entangled in J.J. Abrams' sci-fi drama about a conspiracy that begins with mysterious deaths on an airplane.", "numOfCriticReviews": 47, "numOfPositiveCriticReviews": 36, "numOfMixedCriticReviews": 11, "numOfNegativeCriticReviews": 0}}}, "Hannibal": {"data": {"tvshow": {"title": "Hannibal", "season": "all", "criticScore": 77, "releaseDate": "April 4, 2013", "genres": ["Suspense"], "summary": "FBI head of Behavioral Sciences Jack Crawford (Laurence Fishburne) brings together FBI profiler Will Graham (Hugh Dancy) and psychiatrist Dr. Hannibal Lecter (Mads Mikkelsen) to help solve cases.", "numOfCriticReviews": 61, "numOfPositiveCriticReviews": 48, "numOfMixedCriticReviews": 10, "numOfNegativeCriticReviews": 3}}}, "Luke Cage": {"errors": [{"message": "Error: Product has no reviews or does not exist for: {\n  \"title\": \"Luke Cage\",\n  \"type\": \"tvshow\"\n}, tvshow", "locations": [{"line": 2, "column": 1}], "path": ["tvshow"], "extensions": {"code": "INTERNAL_SERVER_ERROR"}}], "data": {"tvshow": null}}, "Legion": {"data": {"tvshow": {"title": "Legion", "season": "all", "criticScore": 82, "releaseDate": "February 8, 2017", "genres": ["Science Fiction"], "summary": "Diagnosed as schizophrenic and now institutionalized, David Haller's (Dan Stevens) routine at a a psychiatric hospital is changed with the arrival of a new patient named Syd (Rachel Keller) and the discovery that the voices and visions may be real.", "numOfCriticReviews": 56, "numOfPositiveCriticReviews": 48, "numOfMixedCriticReviews": 7, "numOfNegativeCriticReviews": 1}}}, "The Handmaid's Tale Season 1": {"errors": [{"message": "Error: Product has no reviews or does not exist for: {\n  \"title\": \"The Handmaid's Tale Season 1\",\n  \"type\": \"tvshow\"\n}, tvshow", "locations": [{"line": 2, "column": 1}], "path": ["tvshow"], "extensions": {"code": "INTERNAL_SERVER_ERROR"}}], "data": {"tvshow": null}}, "Avatar: The Last Airbender": {"errors": [{"message": "Error: Product has no reviews or does not exist for: {\n  \"title\": \"Avatar: The Last Airbender\",\n  \"type\": \"tvshow\"\n}, tvshow", "locations": [{"line": 2, "column": 1}], "path": ["tvshow"], "extensions": {"code": "INTERNAL_SERVER_ERROR"}}], "data": {"tvshow": null}}}